In [ ]:
import pandas as pd

# Создание датафреймов (пункты приема)

In [ ]:
income_o_data = {
    'point': [1, 1, 1, 1, 1, 2, 2, 3, 3],
    'date': [
        '2001-03-22',
        '2001-03-23',
        '2001-03-24',
        '2001-04-13',
        '2001-05-11',
        '2001-03-22',
        '2001-03-24',
        '2001-09-13',
        '2001-10-02'
    ],
    'inc': [15000, 15000, 3400, 5000, 4500, 10000, 1500, 11500, 18000]
}
income_o = pd.DataFrame(income_o_data)

In [ ]:
outcome_o_data = {
    'point': [1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 3, 3, 3],
    'date': [
        '2001-03-14',
        '2001-03-24',
        '2001-03-26',
        '2001-03-28',
        '2001-03-29',
        '2001-04-11',
        '2001-04-13',
        '2001-04-27',
        '2001-05-11',
        '2001-03-22',
        '2001-03-29',
        '2001-04-02',
        '2001-09-13',
        '2001-09-14',
        '2002-09-16'
    ],
    'out': [15348, 3663, 1221, 2075, 2004, 3195, 4490, 3110, 2530, 1440, 7848, 2040, 1500, 2300, 2150]
}
outcome_o = pd.DataFrame(outcome_o_data)

In [ ]:
income_data = {
    'code': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
    'point': [1, 1, 1, 2, 2, 1, 1, 1, 2, 1, 1, 3, 3],
    'date': [
        '2001-03-22',
        '2001-03-23',
        '2001-03-24',
        '2001-03-22',
        '2001-03-24',
        '2001-04-13',
        '2001-05-11',
        '2001-03-22',
        '2001-03-24',
        '2001-04-13',
        '2001-03-24',
        '2001-09-13',
        '2001-09-13'
    ],
    'inc': [15000, 15000, 3600, 10000, 1500, 5000, 4500, 15000, 1500, 5000, 3400, 1350, 1750]
}
income = pd.DataFrame(income_data)

In [ ]:
outcome_data = {
    'code': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18],
    'point': [1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 1, 2, 1, 3, 3, 3],
    'date': [
        '2001-03-14',
        '2001-03-24',
        '2001-03-26',
        '2001-03-28',
        '2001-03-29',
        '2001-04-11',
        '2001-04-13',
        '2001-04-27',
        '2001-05-11',
        '2001-03-22',
        '2001-03-29',
        '2001-04-02',
        '2001-03-24',
        '2001-03-22',
        '2001-03-29',
        '2001-09-13',
        '2001-09-13',
        '2001-09-14'
    ],
    'out': [15348, 3663, 1221, 2075, 2004, 3195, 4490, 3110, 2530, 1440, 7848, 2040, 3500, 1440, 2006, 1200, 1500, 1150]
}
outcome = pd.DataFrame(outcome_data)

In [ ]:
income_o['date'] = pd.to_datetime(income_o['date'])
outcome_o['date'] = pd.to_datetime(outcome_o['date'])
income['date'] = pd.to_datetime(income['date'])
outcome['date'] = pd.to_datetime(outcome['date'])

# Создание датафреймов (полеты)

In [ ]:
company_date = {
    'ID_comp': [1, 2, 3, 4, 5],
    'name': ['Don_avia', 'Aeroflot', 'Dale_avia', 'air_France', 'British_AW']
}

company = pd.DataFrame(company_date)

In [ ]:
trip_data = {
    'trip_no': [1100, 1101, 1123, 1124, 1145, 1146, 1181, 1182, 1187, 1188, 1195, 1196, 7771, 7772, 7773, 7774, 7775, 7776, 7777, 7778, 8881, 8882],
    'ID_comp': [4, 4, 3, 3, 2, 2, 1, 1, 1, 1, 1, 1, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5],
    'plane': ['Boeing', 'Boeing', 'TU-154', 'TU-154', 'IL-86', 'IL-86', 'TU-134', 'TU-134', 'TU-134', 'TU-134', 'TU-154', 'TU-154', 'Boeing', 'Boeing', 'Boeing', 'Boeing', 'Boeing', 'Boeing', 'Boeing', 'Boeing', 'Boeing', 'Boeing'],
    'town_from': ['Rostov', 'Paris', 'Rostov', 'Vladivostok', 'Moscow', 'Rostov', 'Rostov', 'Moscow', 'Rostov', 'Moscow', 'Rostov', 'Moscow', 'London', 'Singapore', 'London', 'Singapore', 'London', 'Singapore', 'London', 'Singapore', 'London', 'Paris'],
    'town_to': ['Paris', 'Rostov', 'Vladivostok', 'Rostov', 'Rostov', 'Moscow', 'Moscow', 'Rostov', 'Moscow', 'Rostov', 'Moscow', 'Rostov', 'Singapore', 'London', 'Singapore', 'London', 'Singapore', 'London', 'Singapore', 'London', 'Paris', 'London'],
    'time_out': [
        '1900-01-01 14:30:00', '1900-01-01 08:12:00', '1900-01-01 16:20:00', '1900-01-01 09:00:00', '1900-01-01 09:35:00', '1900-01-01 17:55:00',
        '1900-01-01 06:12:00', '1900-01-01 12:35:00', '1900-01-01 15:42:00', '1900-01-01 22:50:00', '1900-01-01 23:30:00', '1900-01-01 04:00:00',
        '1900-01-01 01:00:00', '1900-01-01 12:00:00', '1900-01-01 03:00:00', '1900-01-01 14:00:00', '1900-01-01 09:00:00', '1900-01-01 18:00:00',
        '1900-01-01 18:00:00', '1900-01-01 22:00:00', '1900-01-01 03:00:00', '1900-01-01 22:00:00'
    ],
    'time_in': [
        '1900-01-01 17:50:00', '1900-01-01 11:45:00', '1900-01-01 03:40:00', '1900-01-01 19:50:00', '1900-01-01 11:23:00', '1900-01-01 20:01:00',
        '1900-01-01 08:01:00', '1900-01-01 14:30:00', '1900-01-01 17:39:00', '1900-01-01 00:48:00', '1900-01-01 01:11:00', '1900-01-01 05:45:00',
        '1900-01-01 11:00:00', '1900-01-01 02:00:00', '1900-01-01 13:00:00', '1900-01-01 06:00:00', '1900-01-01 20:00:00', '1900-01-01 08:00:00',
        '1900-01-01 06:00:00', '1900-01-01 12:00:00', '1900-01-01 04:00:00', '1900-01-01 23:00:00'
    ]
}

trip = pd.DataFrame(trip_data)

In [ ]:
passenger_data = {
    'ID_psg': [
        1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
        11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
        21, 22, 23, 24, 25, 26, 27, 28, 29, 30,
        31, 37
    ],
    'name': [
        'Bruce Willis', 'George Clooney', 'Kevin Costner', 'Donald Sutherland', 'Jennifer Lopez',
        'Ray Liotta', 'Samuel L. Jackson', 'Nikole Kidman', 'Alan Rickman', 'Kurt Russell',
        'Harrison Ford', 'Russell Crowe', 'Steve Martin', 'Michael Caine', 'Angelina Jolie',
        'Mel Gibson', 'Michael Douglas', 'John Travolta', 'Sylvester Stallone', 'Tommy Lee Jones',
        'Catherine Zeta-Jones', 'Antonio Banderas', 'Kim Basinger', 'Sam Neill', 'Gary Oldman',
        'Clint Eastwood', 'Brad Pitt', 'Johnny Depp', 'Pierce Brosnan', 'Sean Connery',
        'Bruce Willis', 'Mullah Omar'
    ]
}

passenger = pd.DataFrame(passenger_data)

In [ ]:
pass_in_trip_data = {
    'trip_no': [
        1100, 1123, 1123, 1123, 1124, 1145, 1181, 1181, 1181, 1181,
        1182, 1187, 1188, 1182, 1145, 8882, 7771, 7772, 8881, 7778,
        7772, 7771, 7771, 7771, 7772, 7773, 7772, 8882, 7771, 7771,
        7772, 1187
    ],
    'date': [
        '2003-04-29', '2003-04-05', '2003-04-08', '2003-04-08', '2003-04-02', '2003-04-05',
        '2003-04-01', '2003-04-01', '2003-04-01', '2003-04-13', '2003-04-13', '2003-04-14',
        '2003-04-01', '2003-04-13', '2003-04-25', '2005-11-06', '2005-11-07', '2005-11-07',
        '2005-11-08', '2005-11-05', '2005-11-29', '2005-11-04', '2005-11-07', '2005-11-09',
        '2005-11-07', '2005-11-07', '2005-11-29', '2005-11-13', '2005-11-14', '2005-11-16',
        '2005-11-29', '2003-04-14'
    ],
    'ID_psg': [
        1, 3, 1, 6, 2, 3, 1, 6, 8, 5, 5, 8, 8, 9, 5, 37, 37, 37,
        37, 10, 10, 11, 11, 11, 12, 13, 13, 14, 14, 14, 14, 10
    ],
    'place': [
        '1a', '2a', '4c', '4b', '2d', '2c', '1a', '1b', '3c', '1b',
        '4b', '3a', '3a', '6d', '1d', '1a', '1c', '1a', '1d', '2a',
        '3a', '4a', '1b', '5a', '1d', '2d', '1b', '3d', '4d', '5d',
        '1c', '3d'
    ]
}

pass_in_trip = pd.DataFrame(pass_in_trip_data)

In [ ]:
trip['time_out'] = pd.to_datetime(trip_data['time_out'])
trip['time_in'] = pd.to_datetime(trip_data['time_in'])
pass_in_trip['date'] = pd.to_datetime(pass_in_trip['date'])

# Создание датафреймов (ПК и принтеры)

In [ ]:
product_data = {
    'maker': ['B', 'A', 'A', 'E', 'A', 'D', 'A', 'C', 'A', 'A', 'D', 'E', 'B', 'A', 'E', 'E'],
    'model': [1121, 1232, 1233, 1260, 1276, 1288, 1298, 1321, 1401, 1408, 1433, 1434, 1750, 1752, 2112, 2113],
    'type': ['PC', 'PC', 'PC', 'PC', 'Printer', 'Printer', 'Laptop', 'Laptop', 'Printer', 'Printer', 'Printer', 'Printer', 'Laptop', 'Laptop', 'PC', 'PC']
}

product = pd.DataFrame(product_data)

In [ ]:
pc_data = {
    'code': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
    'model': [1232, 1121, 1233, 1121, 1121, 1233, 1232, 1232, 1232, 1260, 1233, 1233],
    'speed': [500, 750, 500, 600, 600, 750, 500, 450, 450, 500, 900, 800],
    'ram': [64, 128, 64, 128, 128, 128, 32, 64, 32, 32, 128, 128],
    'hd': [5.0, 14.0, 5.0, 14.0, 8.0, 20.0, 10.0, 8.0, 10.0, 10.0, 40.0, 20.0],
    'cd': ['12x', '40x', '12x', '40x', '40x', '50x', '12x', '24x', '24x', '12x', '40x', '50x'],
    'price': [600.0000, 850.0000, 600.0000, 850.0000, 850.0000, 950.0000, 400.0000, 350.0000, 350.0000, 350.0000, 980.0000, 970.0000]
}

pc = pd.DataFrame(pc_data)

In [ ]:
laptop_data = {
    'code': [1, 2, 3, 4, 5, 6],
    'model': [1298, 1321, 1750, 1298, 1752, 1298],
    'speed': [350, 500, 750, 600, 750, 450],
    'ram': [32, 64, 128, 64, 128, 64],
    'hd': [4.0, 8.0, 12.0, 10.0, 10.0, 10.0],
    'price': [700.0000, 970.0000, 1200.0000, 1050.0000, 1150.0000, 950.0000],
    'screen': [11, 12, 14, 15, 14, 12]
}

laptop = pd.DataFrame(laptop_data)

In [ ]:
printer_data = {
    'code': [6, 5, 4, 3, 2, 1],
    'model': [1288, 1408, 1401, 1434, 1433, 1276],
    'color': ['n', 'n', 'n', 'y', 'y', 'n'],
    'type': ['Laser', 'Matrix', 'Matrix', 'Jet', 'Jet', 'Laser'],
    'price': [400.0000, 270.0000, 150.0000, 290.0000, 270.0000, 400.0000]
}

printer = pd.DataFrame(printer_data)

# Создание датафреймов (корабли)

In [ ]:
сlasses_data = {
    "class": ["Bismarck", "Iowa", "Kongo", "North Carolina", "Renown", "Revenge", "Tennessee", "Yamato"],
    "type": ["bb", "bb", "bc", "bb", "bc", "bb", "bb", "bb"],
    "country": ["Germany", "USA", "Japan", "USA", "Gt.Britain", "Gt.Britain", "USA", "Japan"],
    "numGuns": [8, 9, 8, 12, 6, 8, 12, 9],
    "bore": [15.0, 16.0, 14.0, 16.0, 15.0, 15.0, 14.0, 18.0],
    "displacement": [42000, 46000, 32000, 37000, 32000, 29000, 32000, 65000]
}

сlasses = pd.DataFrame(сlasses_data)

In [ ]:
ships_data = {
    "name": [
        "California", "Haruna", "Hiei", "Iowa", "Kirishima", "Kongo",
        "Missouri", "Musashi", "New Jersey", "North Carolina",
        "Ramillies", "Renown", "Repulse", "Resolution", "Revenge",
        "Royal Oak", "Royal Sovereign", "South Dakota", "Tennessee",
        "Washington", "Wisconsin", "Yamato"
    ],
    "class": [
        "Tennessee", "Kongo", "Kongo", "Iowa", "Kongo", "Kongo",
        "Iowa", "Yamato", "Iowa", "North Carolina", "Revenge",
        "Renown", "Renown", "Renown", "Revenge",
        "Revenge", "Revenge", "North Carolina", "Tennessee",
        "North Carolina", "Iowa", "Yamato"
    ],
    "launched": [
        1921, 1916, 1914, 1943, 1915, 1913,
        1944, 1942, 1943, 1941, 1917,
        1916, 1916, 1916, 1916,
        1916, 1916, 1941, 1920,
        1941, 1944, 1941
    ]
}

ships = pd.DataFrame(ships_data)

In [ ]:
battles_data = {
    "name": [
        "#Cuba62a", "#Cuba62b", "Guadalcanal",
        "North Atlantic", "North Cape", "Surigao Strait"
    ],
    "date": [
        "1962-10-20", "1962-10-25", "1942-11-15",
        "1941-05-25", "1943-12-26", "1944-10-25"
    ]
}

battles = pd.DataFrame(battles_data)

In [ ]:
outcomes_data = {
    "ship": [
        "Bismarck", "California", "CAlifornia", "Duke of York", "Fuso",
        "Hood", "King George V", "Kirishima", "Prince of Wales", "Rodney",
        "Schamhorst", "South Dakota", "Tennessee", "Washington",
        "West Virginia", "Yamashiro"
    ],
    "battle": [
        "North Atlantic", "Guadalcanal", "Surigao Strait", "North Cape",
        "Surigao Strait", "North Atlantic", "North Atlantic", "Guadalcanal",
        "North Atlantic", "North Atlantic", "North Cape", "Guadalcanal",
        "Surigao Strait", "Guadalcanal", "Surigao Strait", "Surigao Strait"
    ],
    "result": [
        "sunk", "damaged", "ok", "ok", "sunk",
        "sunk", "ok", "sunk", "damaged", "OK",
        "sunk", "damaged", "ok", "ok", "ok", "sunk"
    ]
}
outcomes = pd.DataFrame(outcomes_data)

In [ ]:
battles['date'] = pd.to_datetime(battles['date'])

# Создание датафреймов (краски)

In [ ]:
utQ_data = {
    "Q_ID": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 25],
    "Q_NAME": [
        "Square # 01", "Square # 02", "Square # 03", "Square # 04", "Square # 05",
        "Square # 06", "Square # 07", "Square # 08", "Square # 09", "Square # 10",
        "Square # 11", "Square # 12", "Square # 13", "Square # 14", "Square # 15",
        "Square # 16", "Square # 17", "Square # 18", "Square # 19", "Square # 20",
        "Square # 21", "Square # 22", "Square # 23", "Square # 25"
    ]
}

utQ = pd.DataFrame(utQ_data)

In [ ]:
utB_data = {
    "B_DATETIME": [
        "2000-01-01 01:13:36", "2001-01-01 01:13:37", "2002-01-01 01:13:38",
        "2002-06-01 01:13:39", "2003-01-01 01:12:01", "2003-01-01 01:12:03",
        "2003-01-01 01:12:04", "2003-01-01 01:12:05", "2003-01-01 01:12:06",
        "2003-01-01 01:12:07", "2003-01-01 01:12:08", "2003-01-01 01:12:09",
        "2003-01-01 01:12:10", "2003-01-01 01:12:11", "2003-01-01 01:12:12",
        "2003-01-01 01:12:13", "2003-01-01 01:12:14", "2003-01-01 01:12:15",
        "2003-01-01 01:12:16", "2003-01-01 01:12:17", "2003-01-01 01:12:18",
        "2003-01-01 01:12:19", "2003-01-01 01:12:20", "2003-01-01 01:12:21",
        "2003-01-01 01:12:22", "2003-01-01 01:12:23", "2003-01-01 01:12:24",
        "2003-01-01 01:12:25", "2003-01-01 01:12:26", "2003-01-01 01:12:27",
        "2003-01-01 01:12:28", "2003-01-01 01:12:29", "2003-01-01 01:12:30",
        "2003-01-01 01:12:31", "2003-01-01 01:12:31", "2003-01-01 01:12:33",
        "2003-01-01 01:12:34", "2003-01-01 01:12:35", "2003-01-01 01:12:36",
        "2003-01-01 01:12:37", "2003-01-01 01:12:38", "2003-01-01 01:12:39",
        "2003-01-01 01:12:40", "2003-01-01 01:12:41", "2003-01-01 01:12:42",
        "2003-01-01 01:12:43", "2003-01-01 01:12:44", "2003-01-01 01:12:45",
        "2003-01-01 01:12:46", "2003-01-01 01:12:47", "2003-01-01 01:12:48",
        "2003-01-01 01:13:01", "2003-01-01 01:13:02", "2003-01-01 01:13:03",
        "2003-01-01 01:13:04", "2003-01-01 01:13:05", "2003-01-01 01:13:05",
        "2003-01-01 01:13:06", "2003-01-01 01:13:07", "2003-01-01 01:13:08",
        "2003-01-01 01:13:09", "2003-01-01 01:13:10", "2003-01-01 01:13:11",
        "2003-01-01 01:13:12", "2003-01-01 01:13:13", "2003-01-01 01:13:14",
        "2003-01-01 01:13:15", "2003-01-01 01:13:16", "2003-01-01 01:13:17",
        "2003-01-01 01:13:18", "2003-01-01 01:13:24", "2003-01-01 01:13:25",
        "2003-01-01 01:13:26", "2003-02-01 01:13:19", "2003-02-01 01:13:27",
        "2003-02-01 01:13:31", "2003-02-02 01:13:32", "2003-02-03 01:13:33",
        "2003-02-04 01:13:34", "2003-02-05 01:13:35", "2003-03-01 01:13:20",
        "2003-03-01 01:13:28", "2003-04-01 01:13:21", "2003-04-01 01:13:29",
        "2003-05-01 01:13:22", "2003-05-01 01:13:30", "2003-06-11 01:13:23",
        "2003-06-23 01:12:02"
    ],
    "B_Q_ID": [
        22, 22, 22, 22, 1, 2, 3, 1, 2, 3, 1, 2, 3, 4, 5, 5, 5, 5, 5, 5, 6, 6, 6,
        6, 7, 7, 7, 7, 8, 9, 9, 9, 9, 10, 10, 10, 10, 10, 10, 11, 11, 11, 11, 11,
        11, 12, 12, 12, 12, 12, 12, 4, 8, 13, 14, 4, 14, 15, 15, 15, 15, 16, 16,
        16, 16, 16, 17, 17, 17, 17, 19, 19, 19, 18, 20, 21, 21, 21, 21, 21, 18,
        20, 18, 20, 18, 20, 19, 1
    ],
    "B_V_ID": [
        50, 50, 51, 51, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16,
        10, 17, 18, 19, 17, 20, 21, 22, 10, 23, 24, 25, 26, 25, 26, 27, 28, 29,
        30, 31, 32, 33, 34, 35, 36, 31, 32, 33, 34, 35, 36, 37, 38, 39, 39, 37,
        40, 41, 41, 42, 42, 42, 42, 43, 43, 47, 44, 44, 45, 45, 44, 45, 45, 45,
        49, 49, 50, 50, 50, 50, 45, 45, 46, 46, 46, 46, 44, 1
    ],
    "B_VOL": [
        50, 50, 50, 50, 155, 255, 255, 255, 255, 255, 255, 255, 255, 50, 100,
        155, 155, 100, 50, 205, 155, 100, 255, 255, 155, 100, 255, 255, 50, 255,
        255, 100, 155, 155, 100, 10, 10, 245, 245, 100, 100, 100, 155, 155, 155,
        155, 155, 155, 100, 100, 100, 20, 20, 123, 111, 185, 50, 50, 50, 50, 50,
        50, 50, 50, 50, 10, 10, 10, 10, 10, 10, 10, 50, 50, 50, 50, 1, 1, 50, 50,
        10, 10, 10, 10, 10, 10, 10, 100
    ]
}

utB = pd.DataFrame(utB_data)

In [ ]:
utV_data = {
    "V_ID": [
        1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
        21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38,
        39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54
    ],
    "V_NAME": [
        "Balloon # 01", "Balloon # 02", "Balloon # 03", "Balloon # 04", "Balloon # 05",
        "Balloon # 06", "Balloon # 07", "Balloon # 08", "Balloon # 09", "Balloon # 10",
        "Balloon # 11", "Balloon # 12", "Balloon # 13", "Balloon # 14", "Balloon # 15",
        "Balloon # 16", "Balloon # 17", "Balloon # 18", "Balloon # 19", "Balloon # 20",
        "Balloon # 21", "Balloon # 22", "Balloon # 23", "Balloon # 24", "Balloon # 25",
        "Balloon # 26", "Balloon # 27", "Balloon # 28", "Balloon # 29", "Balloon # 30",
        "Balloon # 31", "Balloon # 32", "Balloon # 33", "Balloon # 34", "Balloon # 35",
        "Balloon # 36", "Balloon # 37", "Balloon # 38", "Balloon # 39", "Balloon # 40",
        "Balloon # 41", "Balloon # 42", "Balloon # 43", "Balloon # 44", "Balloon # 45",
        "Balloon # 46", "Balloon # 47", "Balloon # 48", "Balloon # 49", "Balloon # 50",
        "Balloon # 51", "Balloon # 52", "Balloon # 53", "Balloon # 54"
    ],
    "V_COLOR": [
        "R", "R", "R", "G", "G", "G", "B", "B", "B", "R", "R", "R", "G", "G",
        "B", "B", "R", "G", "B", "R", "G", "B", "R", "G", "B", "B", "R", "G",
        "R", "G", "R", "G", "B", "R", "G", "B", "R", "G", "B", "R", "R", "G",
        "B", "R", "G", "B", "B", "G", "R", "G", "B", "R", "G", "B"
    ]
}
utV = pd.DataFrame(utV_data)

In [ ]:
utB['B_DATETIME'] = pd.to_datetime(utB['B_DATETIME'])

# Задачи

In [ ]:
# income_o, outcome_o, income, outcome
# company, trip, passenger, pass_in_trip
# product, pc, laptop, printer
# сlasses, ships, battles, outcomes
# utQ, utB, utV